#!/bin/bash

# Цвета
GREEN='\033[0;32m'
NC='\033[0m' # Без цвета

# Функция для отображения логотипа
показать_логотип() {
  echo -e "${GREEN}"
  echo -e '███╗   ██╗ ██████╗ ██████╗ ███████╗██████╗ ██╗   ██╗███╗   ██╗███╗   ██╗███████╗██████╗ '
  echo -e '████╗  ██║██╔═══██╗██╔══██╗██╔════╝██╔══██╗██║   ██║████╗  ██║████╗  ██║██╔════╝██╔══██╗'
  echo -e '██╔██╗ ██║██║   ██║██║  ██║█████╗  ██████╔╝██║   ██║██╔██╗ ██║██╔██╗ ██║█████╗  ██████╔╝'
  echo -e '██║╚██╗██║██║   ██║██║  ██║██╔══╝  ██╔══██╗██║   ██║██║╚██╗██║██║╚██╗██║██╔══╝  ██╔══██╗'
  echo -e '██║ ╚████║╚██████╔╝██████╔╝███████╗██║  ██║╚██████╔╝██║ ╚████║██║ ╚████║███████╗██║  ██║'
  echo -e '╚═╝  ╚═══╝ ╚═════╝ ╚═════╝ ╚══════╝╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═══╝╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝'
  echo -e "\nПодписаться на канал may.crypto{🦅} чтобы быть в курсе самых актуальных нод - https://t.me/maycrypto\n"
  echo -e "${NC}"
}

# Вызов функции для отображения логотипа
показать_логотип

# Обновление пакетов
sudo apt update && sudo apt upgrade -y

# Установка дополнительных пакетов
sudo apt install screen -y

# Загрузка и запуск установочного скрипта ноды GaiaNet
curl -sSfL 'https://github.com/GaiaNet-AI/gaianet-node/releases/latest/download/install.sh' | bash

# Выполнение команд в новом процессе оболочки, чтобы окружение было правильно настроено
bash -c "source /root/.bashrc && gaianet init && gaianet start && gaianet info"
